import React, { createContext } from "react";
export const UserContext = createContext({});
function VilaContextProvider({ children }) {
  const users = [
    {
      userName: "person1",
      profilePic: "https://picsum.photos/500/500",
      fullName: " صبرا اخوان ",
      visited: 20,
      verified: false,
      rate: 5.5,
      locationBtio:
      "کیش جز برترین جزیره‌های دیدنی خاورمیانه است. گردشگران کیش را جزیره‌ای تمیز، با تفریحات شبانه‌روزی، سرگرم‌کننده، آرام و با مردمانی مهمان‌دوست توصیف می‌کنند. از مجموع این توصیفات به‌نظر می‌رسد سفر به کیش سفری پر از تجربه‌های لذت‌بخش و جدید است. از اقامتگاه‌هایی که برای اسکان و استراحت شما در طول سفر به جزیره وجود دارد، آپارتمان دنج 5 است. مساحت آپارتمان 58 متر و دارای یک اتاق خواب است. این اقامتگاه برای چهار نفر ظرفیت دارد. جهت استراحت مهمان‌ها یک تخت دونفره و دو رخت‌خواب سنتی مهیاست. آپارتمان نوساز، تمیز و دارای امکانات لازم برای رفاه مهمانان است. که از این امکانات می‌توان به مبلمان، میز ناهارخوری، تلویزیون، گیرنده دیجیتال ایران، کولر گازی، کمد/دراور، بالکن، پارکینگ، دو سرویس بهداشتی ایرانی و فرنگی و یک حمام اشاره کرد. هم‌چنین با وجود آشپزخانه در اقامتگاه امکانات لازم جهت پخت‌وپز و آشپزی نیز وجود دارد. از جمله امکاناتی که در آشپزخانه موجود است کابینت، یخچال، چایی‌ساز، اجاق گاز، وسائل پخت‌و‌پز و آشپزی است. آپارتمان به بازارچه‌ی محلی جهت خرید مواد غذایی و اقلام مورد نیاز روزانه، نزدیک است. دسترسی تا پارک ساحلی و اسکله میرمهنا 5 دقیقه است. در این ساحل امکان اجاره دوچرخه، موتور و اسکوتر نیز وجود دارد که به گردشگران امکان گشت‌زنی در نوار ساحلی جزیره را به‌طول 92 متر می‌دهد. فاصله تا کلاب غواصی 9 .",
      rateInfo: "برای اقامت‌های کوتاه‌مدت ۲٪ و بلندمدت ۷٪ تخفیف لحاظ می‌شود",
      phoneNumber: "09027165900",
      joinedDate: "1400/02/06",
    },
    {
      userName: "person2",
      profilePic: "https://picsum.photos/500/500",
      fullName: "محمد جواد کمالی پور",
      visited: 310,
      verified: true,
      rate: 5.5,
      locationBtio:
        "کیش جز برترین جزیره‌های دیدنی خاورمیانه است. گردشگران کیش را جزیره‌ای تمیز، با تفریحات شبانه‌روزی، سرگرم‌کننده، آرام و با مردمانی مهمان‌دوست توصیف می‌کنند. از مجموع این توصیفات به‌نظر می‌رسد سفر به کیش سفری پر از تجربه‌های لذت‌بخش و جدید است. از اقامتگاه‌هایی که برای اسکان و استراحت شما در طول سفر به جزیره وجود دارد، آپارتمان دنج 5 است. مساحت آپارتمان 58 متر و دارای یک اتاق خواب است. این اقامتگاه برای چهار نفر ظرفیت دارد. جهت استراحت مهمان‌ها یک تخت دونفره و دو رخت‌خواب سنتی مهیاست. آپارتمان نوساز، تمیز و دارای امکانات لازم برای رفاه مهمانان است. که از این امکانات می‌توان به مبلمان، میز ناهارخوری، تلویزیون، گیرنده دیجیتال ایران، کولر گازی، کمد/دراور، بالکن، پارکینگ، دو سرویس بهداشتی ایرانی و فرنگی و یک حمام اشاره کرد. هم‌چنین با وجود آشپزخانه در اقامتگاه امکانات لازم جهت پخت‌وپز و آشپزی نیز وجود دارد. از جمله امکاناتی که در آشپزخانه موجود است کابینت، یخچال، چایی‌ساز، اجاق گاز، وسائل پخت‌و‌پز و آشپزی است. آپارتمان به بازارچه‌ی محلی جهت خرید مواد غذایی و اقلام مورد نیاز روزانه، نزدیک است. دسترسی تا پارک ساحلی و اسکله میرمهنا 5 دقیقه است. در این ساحل امکان اجاره دوچرخه، موتور و اسکوتر نیز وجود دارد که به گردشگران امکان گشت‌زنی در نوار ساحلی جزیره را به‌طول 92 متر می‌دهد. فاصله تا کلاب غواصی 9 .",
      rateInfo: "برای اقامت‌های کوتاه‌مدت ۲٪ و بلندمدت ۷٪ تخفیف لحاظ می‌شود",
      phoneNumber: "09027165900",
      joinedDate: "1400/02/06",
    },
  ];
  return (
    <UserContext.Provider value={{ users }}>{children}</UserContext.Provider>
  );
}

export default VilaContextProvider;
